## Staging: lambda-admin-pr
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.notify_admin_pr will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "notify_admin_pr"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:239043911459:*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/notify-admin-pr-*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ca-central-1:239043911459:repository/notify/admin",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:239043911459:parameter/ENVIRONMENT_VARIABLES",
            ]
        }
    }

  # aws_ecr_repository.notify_admin will be updated in-place
  ~ resource "aws_ecr_repository" "notify_admin" {
        id                   = "notify/admin"
        name                 = "notify/admin"
        tags                 = {}
        # (5 unchanged attributes hidden)


      ~ image_scanning_configuration {
          ~ scan_on_push = false -> true
        }

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.notify_admin_pr will be created
  + resource "aws_iam_policy" "notify_admin_pr" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "notify-admin-pr"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.notify_admin_pr will be created
  + resource "aws_iam_role" "notify_admin_pr" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notify-admin-pr"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.notify_admin_pr will be created
  + resource "aws_iam_role_policy_attachment" "notify_admin_pr" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notify-admin-pr"
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.notify_admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_admin_pr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_admin_pr"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
